plato-on-the-kobo-libra-2.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>plato on the kobo libra 2</title>
<meta name="generator" content="Org Mode" />
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="apple-touch-icon" sizes="180x180" href="./apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="./favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="./favicon-16x16.png">
<meta property="og:title" content="plato on the kobo libra 2">
<meta property="og:description" content="I caught the reading bug again">
<meta property="og:image" content="https://notes.neeasade.net/assets/posts/ca_dump3/c1d5bf5356d331b02e334f249bf97c6e16483b2f32a60524ff5e80c5c2d074ab.png">
<meta property="og:url" content="https://notes.neeasade.net/plato-on-the-kobo-libra-2">
<meta property="description" content="I caught the reading bug again">
<meta name="twitter:card" content="summary">
<link rel='stylesheet' href='./assets/css/colors.css?sum=cbc7f86dcba5597749ac3221baabf396'>
<link rel='stylesheet' href='./assets/css/normalize.css?sum=112272e51c80ffe5bd01becd2ce7d656'>
<link rel='stylesheet' href='./assets/css/magick.css?sum=8aacef8a73bc48c8489e29412bb42f23'>
<link rel='stylesheet' href='./assets/css/notes.css?sum=c20e8c9dec7b22b516bc875c6e26dc69'>
</head>
<body>
<main id="content" class="content">
<header>
<div style="float: left">
    <a href='./index.html'>../notes</a>
</div>

<div style="float: right">
    
    <a href="https://raw.githubusercontent.com/neeasade/neeasade.github.io/source/posts/plato-on-the-kobo-libra-2.org">source</a>
</div>
<h1 class=title>
    <svg viewBox="0 0 40 40" xmlns="http://www.w3.org/2000/svg">
        <rect x="5" y="15" width="20" height="20" fill="none" stroke="#444748" stroke-width="2"/>
        <rect x="14" y="6" width="20" height="20" fill="none" stroke="#444748" stroke-width="2"/>
    </svg>
    plato on the kobo libra 2
    <svg viewBox="0 0 40 40" xmlns="http://www.w3.org/2000/svg">
        <rect x="5" y="15" width="20" height="20" fill="none" stroke="#444748" stroke-width="2"/>
        <rect x="14" y="6" width="20" height="20" fill="none" stroke="#444748" stroke-width="2"/>
    </svg>
</h1>
<div class="org-center">
<p>
I caught the reading bug again
</p>
</div>
<span class=pubinfo>
    Published 2023-06-11,
    last edit <a href="https://github.com/neeasade/neeasade.github.io/commits/source/posts/plato-on-the-kobo-libra-2.org">2025-08-06</a>
</span>
<div class="posttags">  </div>
</header>
<hr>
<p>
For almost a year now I&rsquo;ve been using <a href="https://github.com/baskerville/plato">plato</a> on the <a href="https://us.kobobooks.com/products/kobo-libra-2">kobo libra 2</a>, an e-ink reader
that includes a backlight and a red light scale. The user experience has been
very good (fast, portable, decent battery), here&rsquo;s some howto&rsquo;s.
</p>

<p>
Quicklinks:
</p>

<ul class="org-ul">
<li><a href="https://github.com/baskerville/plato/blob/master/doc/GUIDE.md">plato guide</a></li>
<li><a href="https://github.com/baskerville/plato/blob/master/doc/MANUAL.md">plato manual</a></li>
</ul>
<div id="outline-container-Install" class="outline-2">
<h2 id="Install"><span class="section-number-2">1.</span> Install <a href="#Install">#</a></h2>
<div class="outline-text-2" id="text-Install">
<p>
When you first get the device, you can plug it into your computer and mount it
directly, everything is just owned by root:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ lsblk
NAME   MAJ:MIN RM   SIZE RO TYPE MOUNTPOINTS
sda      8:48   0 232.9G  0 disk
&#9500;&#9472;sda1   8:49   0   550M  0 part /boot
&#9500;&#9472;sda2   8:50   0   225G  0 part /nix/store
&#9474;                                /
&#9492;&#9472;sdd3   8:51   0     4G  0 part [SWAP]
sdb      8:144  1  28.5G  0 disk

$ sudo mount /dev/sdj ~/kobo
</pre>
</div>

<p>
To bypass the kobo account setup, you can exit the database on the device:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ sudo sqlite3 ~/kobo/.kobo/KoboReader.sqlite
sqlite&gt; INSERT INTO user(UserID,UserKey) VALUES(<span style="color: #007c00;">'1'</span>,<span style="color: #007c00;">''</span>);
sqlite&gt; .quit
</pre>
</div>

<p>
Now let&rsquo;s install plato. Current releases can be found at the OP of <a href="https://www.mobileread.com/forums/showthread.php?t=314220">this kobo
forum post</a>. The release is just a zip file that we will extract to <code>~/kobo</code>.
&ldquo;installing&rdquo; just means coping the contents of the release onto the reader:
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo unzip OCP-Plato-0.9.38.zip -d ~/kobo
</pre>
</div>

<p>
After you unmount, there will be a Plato launch icon at the bottom of the
screen - but you&rsquo;ll likely want to do some setup (see below)
</p>
</div>
</div>
<div id="outline-container-Settings" class="outline-2">
<h2 id="Settings"><span class="section-number-2">2.</span> Settings <a href="#Settings">#</a></h2>
<div class="outline-text-2" id="text-Settings">
<p>
Reader settings I have that differ from the default (the Georgia font
just looks &ldquo;right&rdquo; to me for reading):
</p>

<div class="org-src-container">
<pre class="src src-toml">[<span style="color: #006e96;">reader</span>]
<span style="color: #c6007f;">south-strip</span> = <span style="color: #007c00;">"next-page"</span>
<span style="color: #c6007f;">font-path</span> = <span style="color: #007c00;">"/mnt/onboard/.adds/plato/fonts"</span>
<span style="color: #c6007f;">font-family</span> = <span style="color: #007c00;">"Georgia"</span>
<span style="color: #c6007f;">margin-width</span> = 10
<span style="color: #c6007f;">max-margin-width</span> = 20
<span style="color: #c6007f;">line-height</span> = 1.1
<span style="color: #c6007f;">ignore-document-css</span> = <span style="color: #0065c8;">true</span>

[<span style="color: #006e96;">reader.paragraph-breaker</span>]
<span style="color: #c6007f;">stretch-tolerance</span> = 1.5
</pre>
</div>

<p>
The most opinionated setting in here is setting <code>ignore-document-css</code> to true.
This means I have a consistent reading experience for books that are simply
plain text, but if epubs rely on something more fancy for effect (or for example
if I am reading a screenplay) I will turn this off. Overall though, having this
setting on and crushing the exceptions has been worth the consistent experience
for me.
</p>
</div>
</div>
<div id="outline-container-Dictionary" class="outline-2">
<h2 id="Dictionary"><span class="section-number-2">3.</span> Dictionary <a href="#Dictionary">#</a></h2>
<div class="outline-text-2" id="text-Dictionary">
<p>
To install a dictionary, grab a zip from <a href="https://tuxor1337.frama.io/firedict/dictionaries.html">here</a> and unzip it to
<code>~/kobo/.adds/plato/dictionaries</code>. You can long tap a word while reading to look
it up while reading.
</p>
</div>
</div>
<div id="outline-container-Fonts" class="outline-2">
<h2 id="Fonts"><span class="section-number-2">4.</span> Fonts <a href="#Fonts">#</a></h2>
<div class="outline-text-2" id="text-Fonts">
<p>
I add font files to the <code>~/kobo/.adds/plato/fonts</code> dir, and then make them
accessible with this option in <code>Settings.toml</code>:
</p>

<div class="org-src-container">
<pre class="src src-toml"><span style="color: #c6007f;">font-path</span> = <span style="color: #007c00;">"/mnt/onboard/.adds/plato/fonts"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-CSS" class="outline-2">
<h2 id="CSS"><span class="section-number-2">5.</span> CSS <a href="#CSS">#</a></h2>
<div class="outline-text-2" id="text-CSS">
<p>
Create <code>~/kobo/.adds/plato/css/epub-user.css</code>, and add:
</p>

<div class="org-src-container">
<pre class="src src-css"><span style="color: #c6007f;">p</span> {
    <span style="color: #0065c8;">text-align</span>: justify;
    <span style="color: #0065c8;">margin</span>: 1em 0 0 0 <span style="color: #0065c8;">!important</span>;
}

<span style="color: #c6007f;">p + p</span> {
    <span style="color: #0065c8;">text-indent</span>: 1em;
    <span style="color: #0065c8;">margin</span>: 0 <span style="color: #0065c8;">!important</span>;
}

<span style="color: #c6007f;">img</span> { <span style="color: #6a6d6e;">/* </span><span style="color: #6a6d6e;">for centering</span><span style="color: #6a6d6e;"> */</span>
    <span style="color: #0065c8;">margin</span>: auto;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-Library" class="outline-2">
<h2 id="Library"><span class="section-number-2">6.</span> Library <a href="#Library">#</a></h2>
<div class="outline-text-2" id="text-Library">
<p>
For a db located in  <code>~/kobo/library</code>, set path like so:
</p>

<div class="org-src-container">
<pre class="src src-toml">[[<span style="color: #006e96;">libraries</span>]]
<span style="color: #c6007f;">path</span> = <span style="color: #007c00;">"/mnt/onboard/library"</span>
<span style="color: #6a6d6e;"># </span><span style="color: #6a6d6e;">...</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-Debugging" class="outline-2">
<h2 id="Debugging"><span class="section-number-2">7.</span> Debugging <a href="#Debugging">#</a></h2>
<div class="outline-text-2" id="text-Debugging">
<p>
If there are any issues with <code>Settings.toml</code>, the default settings are used and
the config error is logged to an <code>info.log</code> file in the same directory.
</p>
</div>
</div>
<div id="outline-container-❗Caution:-firmware-updates" class="outline-2">
<h2 id="❗Caution:-firmware-updates"><span class="section-number-2">8.</span> ❗Caution: firmware updates <a href="#❗Caution:-firmware-updates">#</a></h2>
<div class="outline-text-2" id="text-❗Caution:-firmware-updates">
<p>
Note that even if you have firmware updates turned off, if you are connected to
the wifi, kobo can still auto-update and break plato for you. Your files will
still be there, you&rsquo;ll just have to copy the plato release over to then device again.
</p>

<footer>
    <div style="float: left">
         <a href='automata-tiles-3.html'>newer: automata tiles 3</a> 
    </div>
    <div style="text-align: right">
         <a href='sharath-led-primary-notes.html'>older: Sharath led primary notes</a> 
    </div>
</footer>
<hr>
</div>
</div>
</main>
</body>
</html>
